## DataFrame에서의 함수들

In [34]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib
matplotlib.rcParams['font.family'] = 'AppleGothic'
matplotlib.rcParams['axes.unicode_minus']=False

#### 사원 관련된 정보

In [48]:
employee = [ {'empno':1,'ename':'kim','deptno':1},
             {'empno':2,'ename':'lee','deptno':2},
             {'empno':3,'ename':'park','deptno':1},
             {'empno':4,'ename':'song','deptno':3},
             {'empno':5,'ename':'min','deptno':2}
           ]

#### 부서별 세부 정보

In [49]:
dept = [{'deptno':1, 'deptname':'계약'},
        {'deptno':2, 'deptname':'영업'},
        {'deptno':3, 'deptname':'개발'}
]

#### 주소 및 전화번호 정보

In [50]:
info = [{'empno':1,'addr':'서울시','phone':'010-1111-1111'},
        {'empno':3,'addr':'부산시','phone':'010-2222-2222'},
        {'empno':2,'addr':'대전시','phone':'010-3333-3333'},
        {'empno':5,'addr':'광주시','phone':'010-4444-4444'},
        {'empno':4,'addr':'인천시','phone':'010-5555-5555'}
       ]

Pandas DataFrame으로 만들기

In [51]:
dfemp = pd.DataFrame(employee)
dept = pd.DataFrame(dept)
info = pd.DataFrame(info)

In [52]:
dfemp

   deptno  empno ename
0       1      1   kim
1       2      2   lee
2       1      3  park
3       3      4  song
4       2      5   min

---
### merge 함수

In [53]:
m = pd.merge(dfemp,dept,on='deptno') # SQL문에서 Join에 해당...dept라는 column을 기준으로 합쳐라 -> on
m.drop(['deptno'],axis=1,inplace=True) # dept
m

   empno ename deptname
0      1   kim       계약
1      3  park       계약
2      2   lee       영업
3      5   min       영업
4      4  song       개발

In [54]:
pd.merge(m,info,on='empno')

   empno ename deptname addr          phone
0      1   kim       계약  서울시  010-1111-1111
1      3  park       계약  부산시  010-2222-2222
2      2   lee       영업  대전시  010-3333-3333
3      5   min       영업  광주시  010-4444-4444
4      4  song       개발  인천시  010-5555-5555

---
### concat 함수

#### axis = 0 일 경우
- 아래로 붙임
- column이 동일해야 깔끔하게
- 없는 column에 대해선 NaN으로 붙게 된다

#### axis = 1 일 경우
- 오른쪽에 붙임
- 없는 경우 NaN이 된다

In [55]:
pd.concat([dfemp,dept],axis=1)

   deptno  empno ename deptname  deptno
0       1      1   kim       계약     1.0
1       2      2   lee       영업     2.0
2       1      3  park       개발     3.0
3       3      4  song      NaN     NaN
4       2      5   min      NaN     NaN

`outer`로 하게 될 경우, 더 큰 놈의 갯수에 맞게 남긴다

In [56]:
pd.concat([dfemp,dept],axis=1,join='outer')

   deptno  empno ename deptname  deptno
0       1      1   kim       계약     1.0
1       2      2   lee       영업     2.0
2       1      3  park       개발     3.0
3       3      4  song      NaN     NaN
4       2      5   min      NaN     NaN

`inner`로 하게 될 경우, concat에서 붙이게 될 경우 더 작은 갯수로 남긴다

In [57]:
pd.concat([dfemp,dept],axis=1,join='inner')

   deptno  empno ename deptname  deptno
0       1      1   kim       계약       1
1       2      2   lee       영업       2
2       1      3  park       개발       3